---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ForegroundDraftPatternIdParam
source: html/8cd55fe2-c412-5662-184d-7891bf89fcdf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ForegroundDraftPatternIdParam Property

"Foreground Fill Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId ForegroundDraftPatternIdParam { get; }
```